<html>

<head>
    <meta charset="utf-8">
    <title>เปรียบเทียบพื้นที่</title>
</head>

<body>
    <?php 
    $t = 0.5;
    $h = 64;
    $w = 4;
    $z = 2+1;
    $resT = $t*$h*$w;
    $resR = $t*$h*$z ;

    $com = ($resT > $resR) ? "พื้นที่สามเหลี่ยมมีขนาดใหญ่กว่า" : "พื้นที่สี่เหลี่ยมคางหมูมีขนาดใหญ่กว่า";

    echo "ฐาน : " . $w . "<br/>สูง : " . $h ;
    echo "<br/><br/>พื้นที่สามเหลี่ยม เท่ากับ " . $resT . "<br/>พื้นที่สี่เหลี่ยมคางหมู เท่ากับ " . $resR;
    echo "<br/><br/><b>ผลลัพธ์ คือ</b> " . $com;
    ?>
</body>

</html>